Revit 2024 API
ViewSet.Insert Method
Insert the specified view into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Insert(
	View item
)
Visual Basic
Public Overridable Function Insert ( _
	item As View _
) As Boolean
Visual C++
public:
virtual bool Insert(
	View^ item
)
Parameters
item
Type: Autodesk.Revit.DB.View
The view to be inserted into the set.
Return Value
Returns whether the view was inserted into the set.
See Also
ViewSet Class
Autodesk.Revit.DB Namespace